In [1]:
import pandas as pd 
import numpy as np

In [5]:
df=pd.read_csv("Book1.csv")

In [6]:

df

         NAME  AGE   Salary
0  developer     25   70000
1       omkar    23   25000
2      suresh    25   50000

In [7]:
df=pd.read_excel("Book1.xlsx")

In [8]:
df

         NAME  AGE   Salary
0  developer     25   70000
1       omkar    23   25000
2      suresh    25   50000

In [14]:
# create dataframe with dictionary
dict={'name':['omkar','suresh','mohit'],'Roll no': [1,2,3],'Mark':[17,18,19]}

In [15]:
dict

{'name': ['omkar', 'suresh', 'mohit'],
 'Roll no': [1, 2, 3],
 'Mark': [17, 18, 19]}

In [16]:
#create dataframe by using dataFrame () of pandas
dataFrame=pd.DataFrame(dict)

In [17]:
dataFrame

     name  Roll no  Mark
0   omkar        1    17
1  suresh        2    18
2   mohit        3    19

In [18]:
tupleData=[('omkar'1,17),('suresh'2,18),('mohit',3,19)]

SyntaxError: invalid syntax (3478476778.py, line 1)

In [21]:
tupleData = [('omkar', 1, 17), ('suresh', 2, 18), ('mohit', 3, 19)]

In [23]:
tupleData

[('omkar', 1, 17), ('suresh', 2, 18), ('mohit', 3, 19)]

In [24]:
df = pd.DataFrame(tupleData, columns=["Name", "Roll no", "Marks"])

In [25]:
print(df)

     Name  Roll no  Marks
0   omkar        1     17
1  suresh        2     18
2   mohit        3     19

# methods of DataFrame

In [26]:
#head() is used to read display section of the data Frame by default it

In [27]:
df=pd.read_csv("Book1.csv")

In [29]:
df.head()

         NAME  AGE   Salary
0  developer     25   70000
1       omkar    23   25000
2      suresh    25   50000

In [30]:
df.head(3)

         NAME  AGE   Salary
0  developer     25   70000
1       omkar    23   25000
2      suresh    25   50000

In [31]:
#tail() is used to display bottam rows of dadaFrame

In [32]:
df.tail()

         NAME  AGE   Salary
0  developer     25   70000
1       omkar    23   25000
2      suresh    25   50000

In [33]:
df=pd.DataFrame(np.arange(0,5).reshape(3,4),index=["Row1","Row2","Row3" columns=['col1','col2','col3']])

SyntaxError: invalid syntax (1946965825.py, line 1)

In [40]:
data = np.arange(0, 12).reshape(3, 4)
df = pd.DataFrame(data, index=["Row1", "Row2", "Row3"], columns=['col1', 'col2', 'col3', 'col4'])

In [41]:
print(df)

      col1  col2  col3  col4
Row1     0     1     2     3
Row2     4     5     6     7
Row3     8     9    10    11

In [44]:
df [['col1','col2']]

      col1  col2
Row1     0     1
Row2     4     5
Row3     8     9

In [46]:
df[1:3]

      col1  col2  col3  col4
Row2     4     5     6     7
Row3     8     9    10    11

In [48]:
#use loc to display row data
#display 3rd row element
df.loc["Row2"]

col1    4
col2    5
col3    6
col4    7
Name: Row2, dtype: int32

In [49]:
type(df.loc["Row1"])

pandas.core.series.Series

In [52]:
df.iloc[2:4,0:2]

      col1  col2
Row3     8     9

# DataFrame basic operatios

In [53]:
df1 = pd.DataFrame(data=[[1, np.nan, 2], [4, 5, 6]], 
                   index=["row1", "row2"], 
                   columns=["col1", "col2", "col3"])

In [54]:
print(df1)

      col1  col2  col3
row1     1   NaN     2
row2     4   5.0     6

In [55]:
df1.replace(to_replace=replace='NaN',value=4)

SyntaxError: invalid syntax (3487667262.py, line 1)

In [56]:
df1.replace(to_replace=np.nan, value=4, inplace=True)

In [57]:
print(df1)

      col1  col2  col3
row1     1   4.0     2
row2     4   5.0     6

In [58]:
df1.isnull().sum()

col1    0
col2    0
col3    0
dtype: int64

#  task -create a student .csv file